<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [ ]:
!pip install sqlalchemy==1.4.1

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [ ]:
!pip install ipython-sql
!pip install ipython-sql prettytable

In [ ]:
%load_ext sql

In [ ]:
import csv, sqlite3
import prettytable
prettytable.DEFAULT = 'DEFAULT'

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [ ]:
!pip install -q pandas

In [ ]:
%sql sqlite:///my_data1.db

In [ ]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

**Note:This below code is added to remove blank rows from table**

In [ ]:
#DROP THE TABLE IF EXISTS

%sql DROP TABLE IF EXISTS SPACEXTABLE;

In [ ]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [15]:
# Correct way to execute SQL query in Jupyter notebook
%sql SELECT DISTINCT "Launch_Site" FROM SPACEXTABLE;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',), ('VAFB SLC-4E',), ('KSC LC-39A',), ('CCAFS SLC-40',)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [ ]:
%sql SELECT * FROM SPACEXTABLE WHERE "Launch_Site" LIKE 'CCA%' LIMIT 5;

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [18]:
%sql SELECT SUM("Payload_Mass__kg_") AS Total_Payload_Mass_NASA_CRS  FROM SPACEXTABLE WHERE "Customer" LIKE '%NASA%CRS%' OR "Customer" LIKE '%NASA (CRS)%';

 * sqlite:///my_data1.db
Done.

[(48213,)]

### Task 3.1




##### If you want to see this broken down by individual missions first, you could run:

In [19]:
%sql SELECT "Flight_Number", "Date", "Payload_Mass__kg_", "Customer"  FROM SPACEXTABLE  WHERE "Customer" LIKE '%NASA%CRS%' OR "Customer" LIKE '%NASA (CRS)%' ORDER BY "Date";

 * sqlite:///my_data1.db
Done.

[('Flight_Number', '2012-10-08', 500, 'NASA (CRS)'),
 ('Flight_Number', '2013-03-01', 677, 'NASA (CRS)'),
 ('Flight_Number', '2014-04-18', 2296, 'NASA (CRS)'),
 ('Flight_Number', '2014-09-21', 2216, 'NASA (CRS)'),
 ('Flight_Number', '2015-01-10', 2395, 'NASA (CRS)'),
 ('Flight_Number', '2015-04-14', 1898, 'NASA (CRS)'),
 ('Flight_Number', '2015-06-28', 1952, 'NASA (CRS)'),
 ('Flight_Number', '2016-04-08', 3136, 'NASA (CRS)'),
 ('Flight_Number', '2016-07-18', 2257, 'NASA (CRS)'),
 ('Flight_Number', '2017-02-19', 2490, 'NASA (CRS)'),
 ('Flight_Number', '2017-06-03', 2708, 'NASA (CRS)'),
 ('Flight_Number', '2017-08-14', 3310, 'NASA (CRS)'),
 ('Flight_Number', '2017-12-15', 2205, 'NASA (CRS)'),
 ('Flight_Number', '2018-04-02', 2647, 'NASA (CRS)'),
 ('Flight_Number', '2018-06-29', 2697, 'NASA (CRS)'),
 ('Flight_Number', '2018-12-05', 2500, 'NASA (CRS)'),
 ('Flight_Number', '2019-05-04', 2495, 'NASA (CRS)'),
 ('Flight_Number', '2019-07-25', 2268, 'NASA (CRS)'),
 ('Flight_Number', '2019-12-05', 2617, 'NASA (CRS), Kacific 1'),
 ('Flight_Number', '2020-03-07', 1977, 'NASA (CRS)'),
 ('Flight_Number', '2020-12-06', 2972, 'NASA (CRS)')]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [21]:
%sql SELECT AVG("Payload_Mass__kg_") AS Average_Payload_Mass_F9_v1_1  FROM SPACEXTABLE  WHERE "Booster_Version" = 'F9 v1.1';

 * sqlite:///my_data1.db
Done.

[(2928.4,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [23]:
%sql SELECT MIN("Date") AS First_Successful_Ground_Landing_Date FROM SPACEXTABLE WHERE "Landing_Outcome" = 'Success (ground pad)';

%sql SELECT "Flight_Number", "Date", "Booster_Version", "Mission_Outcome", "Landing_Outcome"
%sql FROM SPACEXTABLE
%sql WHERE "Landing_Outcome" = 'Success (ground pad)'
%sql ORDER BY "Date" ASC LIMIT 1;

 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
Done.
 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "FROM": syntax error
[SQL: FROM SPACEXTABLE]
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "WHERE": syntax error
[SQL: WHERE "Landing_Outcome" = 'Success (ground pad)']
(Background on this error at: https://sqlalche.me/e/20/e3q8)
 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "ORDER": syntax error
[SQL: ORDER BY "Date" ASC LIMIT 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [24]:
%sql SELECT DISTINCT "Booster_Version"  FROM SPACEXTABLE WHERE "Landing_Outcome" = 'Success (drone ship)' AND "Payload_Mass__kg_" > 4000 AND "Payload_Mass__kg_" < 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [31]:
# Correct way to count successful and failed missions

%sql success_failure_counts = %sql SELECT \      CASE \         WHEN "Mission_Outcome" LIKE '%Success%' THEN 'Success' \          ELSE 'Failure' \     END AS Outcome_Type, \      COUNT(*) AS Count \  FROM SPACEXTABLE \  GROUP BY Outcome_Type;  
success_failure_counts

 * sqlite:///my_data1.db
(sqlite3.OperationalError) near "success_failure_counts": syntax error
[SQL: success_failure_counts = %sql SELECT \ CASE \ WHEN "Mission_Outcome" LIKE '%Success%' THEN 'Success' \ ELSE 'Failure' \ END AS Outcome_Type, \ COUNT(*) AS Count \ FROM SPACEXTABLE \ GROUP BY Outcome_Type;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

NameError: name 'success_failure_counts' is not defined

### Task 8



##### List all the booster_versions that have carried the maximum payload mass. Use a subquery.

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date,0,5)='2015' for year.**

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

<!--
## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2024-07-10 | 1.1 |Anita Verma | Changed Version|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |
-->

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>